# **********************************************************************************************************************
# Урок 1. Переменные и типы данных. Функция type(), input()

# name = "Sultan" # str
# age = 22 # int
# height = 1.75 # float
# is_married = False # boolean
#
# # способы вывода
# print("name:", name)
# print(f"age: {age}") # интерполяция - {выражения}
#
# # получить тип данных объекта
# print(type(name), type(age), type(height), type(is_married))
#
# # получить от пользователя данные, все что получаем от пользователя, это - str
# get_user_name = input("Enter your name: ")
# print(f"значение переменной: {get_user_name}, тип переменной {type(get_user_name)}")
#
# # При попытке ввести число и манипуляции над ним, произойдет ошибка. Во-избежании проблемы используем преобразователи
# first_number = int(input("введите первое первое слагаемое: "))
# second_number = int(input("введите первое второе слагаемое: "))
# print("результат сложения:", first_number + second_number)

# **********************************************************************************************************************
# Урок 2. Математические операторы. Функция округления - round(), функция модуль числа - abs(), привидение типов
# +, -, *, ** (возведение в степень), / (деление с дробной частью), // (деление без дробной части), % (остаток от деления)
print("деление с дробной частью:", round(20 / 3, 2), "|", "деление без дробной части:", 20 // 3)
print("возведение в степень:", 2 ** 4)

# привидение типов, str(), float(), int()
print(str)


